In [12]:
import numpy as np 
import pandas as pd
df = pd.read_csv('employee_data.csv')

In [13]:
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
df

      ID Gender  Experience (Years)                      Position  Salary
0      1      F                   4               DevOps Engineer  109976
1      2      M                   6               DevOps Engineer  120088
2      3      M                  17                 Web Developer  181301
3      4      M                   7         Systems Administrator   77530
4      5      F                  13         Systems Administrator  152397
..   ...    ...                 ...                           ...     ...
395  396      F                  19     Cloud Solutions Architect  236045
396  397      F                  20                 Web Developer  182770
397  398      F                   9         Network Administrator   85550
398  399      M                  18  Database Administrator (DBA)  129996
399  400      F                  11           IT Security Analyst  169058

[400 rows x 5 columns]

In [15]:
df.isna().sum()

ID                    0
Gender                0
Experience (Years)    0
Position              0
Salary                0
dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  400 non-null    int64
 1   Gender              400 non-null    object
 2   Experience (Years)  400 non-null    int64
 3   Position            400 non-null    object
 4   Salary              400 non-null    int64
dtypes: int64(3), object(2)
memory usage: 15.8+ KB

In [17]:
df.head()

   ID Gender  Experience (Years)               Position  Salary
0   1      F                   4        DevOps Engineer  109976
1   2      M                   6        DevOps Engineer  120088
2   3      M                  17          Web Developer  181301
3   4      M                   7  Systems Administrator   77530
4   5      F                  13  Systems Administrator  152397

In [18]:
print(df.tail())   # View the last 5 rows

      ID Gender  Experience (Years)                      Position  Salary
395  396      F                  19     Cloud Solutions Architect  236045
396  397      F                  20                 Web Developer  182770
397  398      F                   9         Network Administrator   85550
398  399      M                  18  Database Administrator (DBA)  129996
399  400      F                  11           IT Security Analyst  169058

In [19]:
df.describe()

               ID  Experience (Years)        Salary
count  400.000000          400.000000     400.00000
mean   200.500000            9.670000  131701.19750
std    115.614301            6.101571   43351.50899
min      1.000000            0.000000   43643.00000
25%    100.750000            4.000000  100484.75000
50%    200.500000           10.000000  128561.50000
75%    300.250000           15.000000  157735.00000
max    400.000000           20.000000  269950.00000

In [20]:
print(df.shape)

(400, 5)

In [21]:

print(df.columns)

Index(['ID', 'Gender', 'Experience (Years)', 'Position', 'Salary'], dtype='object')

In [22]:
df.nunique()

ID                    400
Gender                  2
Experience (Years)     21
Position               11
Salary                400
dtype: int64

In [23]:
df.iloc[100:130,0:4]

      ID Gender  Experience (Years)                      Position
100  101      M                   4         IT Support Specialist
101  102      M                   1               DevOps Engineer
102  103      F                   3         IT Support Specialist
103  104      M                   9     Cloud Solutions Architect
104  105      F                  16               Systems Analyst
105  106      M                   3  Database Administrator (DBA)
106  107      M                   6           IT Security Analyst
107  108      M                  14                    IT Manager
108  109      M                   2             Software Engineer
109  110      M                  14  Database Administrator (DBA)
110  111      M                   9               Systems Analyst
111  112      F                   1         IT Support Specialist
112  113      M                   2                    IT Manager
113  114      F                  18             Software Engineer
114  115      F                   4               Systems Analyst
115  116      M                  18                    IT Manager
116  117      M                  16               DevOps Engineer
117  118      F                   2         Systems Administrator
118  119      F                  13  Database Administrator (DBA)
119  120      F                  17               DevOps Engineer
120  121      F                  18                    IT Manager
121  122      M                  13         Network Administrator
122  123      F                  12               Systems Analyst
123  124      M                  18             Software Engineer
124  125      F                  10             Software Engineer
125  126      F                  18         IT Support Specialist
126  127      M                   5               Systems Analyst
127  128      M                  10         IT Support Specialist
128  129      F                  11               Systems Analyst
129  130      F                  14         IT Support Specialist

In [24]:
df['Gender'].value_counts()

Gender
M    202
F    198
Name: count, dtype: int64

In [25]:
df['Position'].value_counts()

Position
Web Developer                   43
IT Manager                      40
IT Security Analyst             39
Systems Administrator           38
Database Administrator (DBA)    38
DevOps Engineer                 37
Systems Analyst                 37
Software Engineer               36
Network Administrator           31
IT Support Specialist           31
Cloud Solutions Architect       30
Name: count, dtype: int64

In [26]:
df['Salary'].describe()

count       400.00000
mean     131701.19750
std       43351.50899
min       43643.00000
25%      100484.75000
50%      128561.50000
75%      157735.00000
max      269950.00000
Name: Salary, dtype: float64

In [27]:
df['Experience (Years)'].describe()

count    400.000000
mean       9.670000
std        6.101571
min        0.000000
25%        4.000000
50%       10.000000
75%       15.000000
max       20.000000
Name: Experience (Years), dtype: float64

In [28]:
df.groupby(['Gender'])['Position'].value_counts()

Gender  Position
F       Systems Analyst                 22
        Web Developer                   22
        IT Manager                      20
        Software Engineer               18
        Systems Administrator           18
        Cloud Solutions Architect       17
        DevOps Engineer                 17
        IT Security Analyst             17
        IT Support Specialist           17
        Database Administrator (DBA)    16
        Network Administrator           14
M       Database Administrator (DBA)    22
        IT Security Analyst             22
        Web Developer                   21
        DevOps Engineer                 20
        IT Manager                      20
        Systems Administrator           20
        Software Engineer               18
        Network Administrator           17
        Systems Analyst                 15
        IT Support Specialist           14
        Cloud Solutions Architect       13
Name: count, dtype: int64

In [29]:
df.groupby(['Gender'])['Salary'].mean()

Gender
F    132629.974747
M    130790.811881
Name: Salary, dtype: float64

In [30]:
df.groupby(['Position'])['Salary'].mean()

Position
Cloud Solutions Architect       160841.633333
Database Administrator (DBA)    132864.552632
DevOps Engineer                 161859.081081
IT Manager                      170711.550000
IT Security Analyst             134440.820513
IT Support Specialist            87683.806452
Network Administrator           116865.064516
Software Engineer               131357.416667
Systems Administrator           113117.447368
Systems Analyst                 127658.189189
Web Developer                   108238.116279
Name: Salary, dtype: float64

In [31]:
print(df['Salary'].min())

43643

In [32]:
print(df['Salary'].max())

269950

In [33]:
print(df['Salary'].std())

43351.508989511116

In [34]:
df[(df['Salary'] < 50000)]

      ID Gender  Experience (Years)               Position  Salary
64    65      M                   2  IT Support Specialist   48710
111  112      F                   1  IT Support Specialist   43643
147  148      F                   1  IT Support Specialist   49817

In [35]:
df.corr(numeric_only=True)

                          ID  Experience (Years)   Salary
ID                  1.000000            0.067305  0.00868
Experience (Years)  0.067305            1.000000  0.61853
Salary              0.008680            0.618530  1.00000

In [36]:
df.groupby('Position')['Salary'].mean().reset_index()

                        Position         Salary
0      Cloud Solutions Architect  160841.633333
1   Database Administrator (DBA)  132864.552632
2                DevOps Engineer  161859.081081
3                     IT Manager  170711.550000
4            IT Security Analyst  134440.820513
5          IT Support Specialist   87683.806452
6          Network Administrator  116865.064516
7              Software Engineer  131357.416667
8          Systems Administrator  113117.447368
9                Systems Analyst  127658.189189
10                 Web Developer  108238.116279

In [37]:
df.groupby('Gender')['Salary'].mean().reset_index()

  Gender         Salary
0      F  132629.974747
1      M  130790.811881